
        public class Main {
            public static void main(String[] args) {

                for (int i = 0; i <= 30; i++) {
                    if (i % 3 == 0 & i % 5 == 0) {
                        System.out.println(i + " Ping-pong ");
                    } else if (i % 3 == 0) {
                        System.out.println(i + ":Ping");
                    }else if (i % 5 == 0) {
                        System.out.println(i + ":pong");
                    }
                }

/*# 1.4 Циклы
### Повышенная сложность. Задание 4
Это задание очень любят давать на собеседованиях в разных вариациях,
потому мы предлагаем его вам, чтобы вы оценили свои силы.
Необходимо пройти циклом по числам от 1 до 30 включительно и, если
число делится на 3 без остатка, вывести ping, а если число делится
на 5 без остатка, вывести pong.
Если число делится без остатка и на 3, и на 5, необходимо вывести ping pong.
Допускается наличие пустых строк в выводе.
- Вывод должен быть следующий:
1:2:3:ping4:5:pong6:ping7:8:9:ping10:pong11:12:ping13:14:15
:pingpong16:17:18:ping19:20: pong*/


            //-/-/-/-/-/
        }

